Table of Contents
 Class PatchSupport
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of patch support in IDEA StatiCa Detail
[OpenModelClass(typeof(PatchDevice))]
public class PatchSupport : PatchDevice
Inheritance
object
OpenObject
OpenElementId
PatchDevice
PatchSupport
Inherited Members
 PatchDevice.GeomId
 PatchDevice.MasterComponent
 PatchDevice.MasterPoint
 PatchDevice.Position
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PatchSupport()
Constructor
public PatchSupport()
 Edit this page